# Курс основы программирования на Python
# Задание по программированию: Количество слов в тексте
# 24.05.2019
#
# Во входном файле (вы можете читать данные из sys.stdin,
# подключив библиотеку sys) записан текст. Словом считается
# последовательность непробельных символов идущих подряд,
# слова разделены одним или большим числом пробелов или
# символами конца строки. Определите, сколько различных
# слов содержится в этом тексте.
#
# Формат ввода
#
# Вводится текст.
#
# Формат вывода
#
# Выведите ответ на задачу.
#
import sys

print(
    len(
        set(
            sys.stdin.read().split()
        )
    )
)
