# Курс основы программирования на Python
# Задание по программированию: Цена товара
# 27.04.2019
#
# Цена товара обозначена в рублях с точностью до копеек, то есть
# действительным числом с двумя цифрами после десятичной точки. Запишите в
# две целочисленные переменные стоимость товара в виде целого числа рублей и
# целого числа копеек и выведите их на экран. При решении этой задачи нельзя
# пользоваться условными инструкциями и циклами.
#
# Формат ввода
#
# Вводится неотрицательное действительное число.
#
# Формат вывода
#
# Выведите ответ на задачу.

a = float(input())
c = round(a % 1 * 100)
b = int(a // 1)
print(b, c)
